soburi/JN516x-arduino-package/boards.txt
menu.config=Configuration

jn516x.name=NXP JN516x
jn516x.upload.tool=contiki-makehelper
jn516x.upload.protocol=contiki-makehelper
jn516x.build.mcu=jn516x
jn516x.build.board=jn516x
jn516x.build.f_cpu=32000000L
jn516x.build.core=arduino
jn516x.build.variant=jn516x
jn516x.build.compiler.path=C:/NXP/bstudio_nxp/sdk/Tools/ba-elf-ba2-r36379/bin
jn516x.build.uploader.path=""
jn516x.build.make.vars=target_makefile='{runtime.platform.path}/variants/{build.variant}/Makefile.variant' CONTIKI_TARGET_MAIN=override-contiki-jn516x-main.c TARGET_WITH_UART1=1 PLATFORM_CONF_H='{runtime.platform.path}/variants/{build.variant}/{build.variant}-platform-conf.h' PREINCLUDE_FILES='{build.core.path}/weak_pragmas.h'
jn516x.build.make.goals={build.project_name}.bin {build.project_name}.hex {build.project_name}.elf
jn516x.menu.config.TWELITE_BLUE=TWELITE BLUE
jn516x.menu.config.TWELITE_BLUE.build.config_vars=CHIP=JN5164 LINKCMD='{runtime.platform.path}/variants/{build.variant}/ldscript/Arduinize.ld'
jn516x.menu.config.TWELITE_RED=TWELITE RED
jn516x.menu.config.TWELITE_RED.build.config_vars=CHIP=JN5169 LINKCMD='{runtime.platform.path}/variants/{build.variant}/ldscript/Arduinize_JN5169.ld'
jn516x.menu.config.meshbee=Mesh Bee
jn516x.menu.config.meshbee.build.config_vars=CHIP=JN5168 LINKCMD='{runtime.platform.path}/variants/{build.variant}/ldscript/Arduinize.ld'
jn516x.menu.config.jn5169=JN5169
jn516x.menu.config.jn5169.build.config_vars=CHIP=JN5169 LINKCMD='{runtime.platform.path}/variants/{build.variant}/ldscript/Arduinize_JN5169.ld'
jn516x.menu.config.jn5168=JN5168
jn516x.menu.config.jn5168.build.config_vars=CHIP=JN5168 LINKCMD='{runtime.platform.path}/variants/{build.variant}/ldscript/Arduinize.ld'
jn516x.menu.config.jn5164=JN5164
jn516x.menu.config.jn5164.build.config_vars=CHIP=JN5164 LINKCMD='{runtime.platform.path}/variants/{build.variant}/ldscript/Arduinize.ld'
jn516x.menu.config.jn5161=JN5161
jn516x.menu.config.jn5161.build.config_vars=CHIP=JN5161 LINKCMD='{runtime.platform.path}/variants/{build.variant}/ldscript/Arduinize.ld'

native.name=native
native.upload.tool=contiki-makehelper
native.upload.protocol=contiki-makehelper
native.build.mcu=native
native.build.board=native
native.build.f_cpu=32000000L
native.build.core=arduino
native.build.variant=native
native.build.compiler.path=""
native.build.uploader.path=""
native.build.make.vars=target_makefile={runtime.platform.path}/variants/{build.variant}/Makefile.variant PREINCLUDE_FILES='{build.core.path}/weak_pragmas.h'
native.build.make.goals={build.project_name}.bin {build.project_name}.hex {build.project_name}.elf
native.menu.config.raspi=RaspberryPi
native.menu.config.raspi.build.config_vars=

minimal-net.name=minimal-net
minimal-net.upload.tool=contiki-makehelper
minimal-net.upload.protocol=contiki-makehelper
minimal-net.build.mcu=minimal_net
minimal-net.build.board=minimal_net
minimal-net.build.f_cpu=32000000L
minimal-net.build.core=arduino
minimal-net.build.variant=minimal-net
minimal-net.build.compiler.path=""
minimal-net.build.uploader.path=""
minimal-net.build.make.vars=target_makefile={runtime.platform.path}/variants/{build.variant}/Makefile.variant CONTIKI_WITH_IPV4=1 PREINCLUDE_FILES='{build.core.path}/weak_pragmas.h'
minimal-net.build.make.goals={build.project_name}.bin {build.project_name}.hex {build.project_name}.elf
minimal-net.menu.config.raspi=RaspberryPi
minimal-net.menu.config.raspi.build.config_vars=
